In [1]:
import pandas as pd

In [4]:
df1=pd.DataFrame([('Jan','B100',20),('Feb','B100',5)],columns=['Month','Book','Units'])

In [5]:
df2=pd.DataFrame([('Jan','B200',60),('Feb','B200',60)],columns=['Month','Book','Units'])

In [6]:
df1

  Month  Book  Units
0   Jan  B100     20
1   Feb  B100      5

In [7]:
df2

  Month  Book  Units
0   Jan  B200     60
1   Feb  B200     60

In [11]:
pd.concat([df1,df2],ignore_index=True)

  Month  Book  Units
0   Jan  B100     20
1   Feb  B100      5
2   Jan  B200     60
3   Feb  B200     60

In [20]:
df1=pd.DataFrame({'name':['ram','game','hum'],'age':[10,20,30]})
df2=pd.DataFrame({'name':['ram','gggame','hum'],'gender':['m','f','m']})

In [21]:
df1

   name  age
0   ram   10
1  game   20
2   hum   30

In [22]:
df2

     name gender
0     ram      m
1  gggame      f
2     hum      m

In [23]:
pd.merge(df1,df2)

  name  age gender
0  ram   10      m
1  hum   30      m

In [24]:
pd.merge(df1,df2,how='outer')

     name   age gender
0     ram  10.0      m
1    game  20.0    NaN
2     hum  30.0      m
3  gggame   NaN      f

In [26]:
s1 = pd.Series(['m','f','f'],name='Gen')

In [27]:
df1.join(s1)

   name  age Gen
0   ram   10   m
1  game   20   f
2   hum   30   f

In [28]:
df1.set_index('name').join(df2.set_index('name'))

      age gender
name
ram    10      m
game   20    NaN
hum    30      m